text/09-regular-expressions.org
#+title: Chapter 9 : Regular Expressions

* <<intro>>

This chapter gives a brief introduction to formal language theory, up to the definition of regular expressions.  Then the technique introduced in the previous chapter is used to construct a program which reads regular expressions and then writes the strings in the language defined by the expression.

* Some formal language theory

In the same way as (unordered) sets are treated in set theory, (ordered) sequences or strings are treated formally in what is known as formal language theory.  This section only gives a very simple introduction which is just adequate for describing what the program in the next section does.

** Strings and operations on strings

In the following, let A be any finite set of elements.  The set A may be the set of coins in my pocket, or the set of days of the week, or the set ={=John, 42, London=}=, consisting of the person John, the number 42 and the city London, or the set of English words, or the set of ASCII characters.

In formal language theory the set A is often called the /alphabet/.  We now define /strings/ over an alphabet (sometimes called /words/ over an alphabet): a string S over an alphabet A is a sequence of elements of A.  For example, the sequence =<=42, London, 42, 42=>= is a string over the third set just mentioned.

The following is a string over the set of vowels: =<e, i, i, e, u>=.  If the alphabet consists of just letters, we allow the alternative notation ="eiieu"=.  It is convenient to allow the empty string =""=.  This may be formalised by the following recursive definition:

#+begin_example
1) The null string "" is a string over any alphabet A.
2) IF x is an element of the alphabet A,
        and S is a string over the alphabet A
   THEN the string consisting of x followed by the elements of S
        is a string over the alphabet A.
#+end_example

An important binary operation on strings is /concatenation/; We use the underscore ="_"= as the explicit infix symbol for concatenation.  Just as the sum of 2 and 3, written 2 + 3, is 5, so the concatenation of ="abc"= and ="de"=, written ="abc"_"de"=, is ="abcde"=.

Concatenation is associative --- hence no brackets are needed for multiple concatenations, and the null string is the left and right identity.

Every string has a non-negative length, the null string has length 0, and the concatenation of two strings has a length which is the sum of the lengths of the two strings concatenated.  The n-fold concatenation of a string with itself is called its n-th /power/.  For example, the 3-rd power of ="abc"=, written: ="abc"=^3 , is ="abcabcabc"=.  The length of the n-th power of a string is the n-th product of the length of the string.  Clearly, the n-th power of the null string =""= is just =""=, the 1-st power of any string is itself, and by definition the 0-th power of any string is =""=.  Another view which is sometimes useful is that a string over alphabet A is a function from an initial segment of the natural numbers into A; this view makes indexing primary --- for example, using =[= and =]= containing a numeric expression as the index, ="abcd"[2]= = ="b"=.

** Languages and operations on languages

A /language/ over an alphabet A is defined to be a set of strings over A.  For example, the finite set ={"ae", "eea", "i"}= is a finite language over the set of vowels, the infinite set ={"0", "1", "10", "11", "100", "101", "110", "111", ...}= is the infinite language of binary numerals for natural numbers over the alphabet of binary digits, and the infinite set ={"", "a", "aa", "aaa", "aaaa", ...}= is the infinite language of all strings over the alphabet ={a}=.

Since languages are sets, the usual set theoretic operations apply; they are: the binary operations of intersection, union, difference and symmetric difference, and a binary operation of complementation with respect to all strings over a given alphabet.  Only union will be important in what follows; in the literature it is often called /alternation/, written as an infix operator ='|'=, so =L | M= is the union or alternation of the two languages =L= and =M=.

Another important operation on languages arises not because languages are sets but because they are composed of strings, and strings can be concatenated.  If =S= and =T= are two strings, then their unit sets are the languages ={S}= and ={T}=, their concatenation is =S _ T=, and the unit set of their concatenation is ={S _ T}=, which we now also write as ={S}_{T}=, as the /concatenation/ of two /languages/.  More generally, if =L= and =M= are two languages, then their concatenation =L _ M= is defined to be the language consisting of strings concatenated from two parts, the first from =L= and the second from =M=.  The unit language ={""}=, whose only element is the null string, is the left and right identity of concatenation of languages.  We shall write =0= for ={""}=, and it is important to distinguish it from the empty language, the null set ={}=, which is the left and right identity of alternation.

The n-fold concatenation of a language =L= with itself is its n-th /power/, written =L=^n , and note that the 1-st power, =L=^1 , is just =L=, and by definition the 0-th power of L, =L=^0 , is just 0, the language ={""}=.  The union of all powers, =L=^0 =|= =L=^1 =|= =L=^2 =|= =L=^3 =| ...=, The union of all positive powers, =L=^1 =|= =L=^2 =|= =L=^3 =| ...=, is written =L+= and called the positive closure of =L=.  The union of the first two powers, =L=^0 =|= =L=^1 , is written =L?=, and might be called the optional closure of =L= --- it is just =L= with the null string added if it was not there already.

