09-regular-expressions.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 9 : Regular Expressions</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 9 : Regular Expressions"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:04 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 9 : Regular Expressions</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 Some formal language theory</a>
<ul>
<li><a href="#sec-2-1">2.1 Strings and operations on strings</a></li>
<li><a href="#sec-2-2">2.2 Languages and operations on languages</a></li>
<li><a href="#sec-2-3">2.3 Regular expressions and regular languages</a></li>
<li><a href="#sec-2-4">2.4 Exercises and reading</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 <i>Formalisation</i>:</a></li>
<li><a href="#sec-2-4-2">2.4.2 <i>MU-expression</i>:</a></li>
<li><a href="#sec-2-4-3">2.4.3 <i>Binary relations</i>:</a></li>
<li><a href="#sec-2-4-4">2.4.4 <i>Reading</i>:</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 A regular expression expander</a>
<ul>
<li><a href="#sec-3-1">3.1 User manual</a></li>
<li><a href="#sec-3-2">3.2 Designing the implementation</a></li>
<li><a href="#sec-3-3">3.3 The program</a></li>
<li><a href="#sec-3-4">3.4 Exercises and reading</a></li>
<li><a href="#sec-3-5">3.5 <i>Parser</i>:</a></li>
<li><a href="#sec-3-6">3.6 <i>Futility heuristic</i>:</a></li>
<li><a href="#sec-3-7">3.7 <i>Reading</i>:</a></li>
<li><a href="#sec-3-8">3.8 <i>Background reading</i>:</a></li>
<li><a href="#sec-3-9">3.9 <i>MU-expression</i>:</a></li>
<li><a href="#sec-3-10">3.10 Addendum 2003</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
This chapter gives a brief introduction to formal language theory, up to the definition of regular expressions.  Then the technique introduced in the previous chapter is used to construct a program which reads regular expressions and then writes the strings in the language defined by the expression.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Some formal language theory</h2>
<div class="outline-text-2" id="text-2">


<p>
In the same way as (unordered) sets are treated in set theory, (ordered) sequences or strings are treated formally in what is known as formal language theory.  This section only gives a very simple introduction which is just adequate for describing what the program in the next section does.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Strings and operations on strings</h3>
<div class="outline-text-3" id="text-2-1">


<p>
In the following, let A be any finite set of elements.  The set A may be the set of coins in my pocket, or the set of days of the week, or the set <code>{=John, 42, London</code>}=, consisting of the person John, the number 42 and the city London, or the set of English words, or the set of ASCII characters.
</p>
<p>
In formal language theory the set A is often called the <i>alphabet</i>.  We now define <i>strings</i> over an alphabet (sometimes called <i>words</i> over an alphabet): a string S over an alphabet A is a sequence of elements of A.  For example, the sequence <code>&lt;=42, London, 42, 42=&gt;</code> is a string over the third set just mentioned.
</p>
<p>
The following is a string over the set of vowels: <code>&lt;e, i, i, e, u&gt;</code>.  If the alphabet consists of just letters, we allow the alternative notation ="eiieu"=.  It is convenient to allow the empty string =""=.  This may be formalised by the following recursive definition:
</p>



<pre class="example">1) The null string "" is a string over any alphabet A.
2) IF x is an element of the alphabet A,
        and S is a string over the alphabet A
   THEN the string consisting of x followed by the elements of S
        is a string over the alphabet A.
</pre>


<p>
An important binary operation on strings is <i>concatenation</i>; We use the underscore ="_"= as the explicit infix symbol for concatenation.  Just as the sum of 2 and 3, written 2 + 3, is 5, so the concatenation of ="abc"= and ="de"=, written ="abc"_"de"=, is ="abcde"=.
</p>
<p>
Concatenation is associative &mdash; hence no brackets are needed for multiple concatenations, and the null string is the left and right identity.
</p>
<p>
Every string has a non-negative length, the null string has length 0, and the concatenation of two strings has a length which is the sum of the lengths of the two strings concatenated.  The n-fold concatenation of a string with itself is called its n-th <i>power</i>.  For example, the 3-rd power of ="abc"=, written: ="abc"<code>^3 , is ="abcabcabc"=.  The length of the n-th power of a string is the n-th product of the length of the string.  Clearly, the n-th power of the null string =""= is just =""=, the 1-st power of any string is itself, and by definition the 0-th power of any string is =""=.  Another view which is sometimes useful is that a string over alphabet A is a function from an initial segment of the natural numbers into A; this view makes indexing primary --- for example, using =[</code> and <code>]</code> containing a numeric expression as the index, ="abcd"<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>= = ="b"=.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Languages and operations on languages</h3>
<div class="outline-text-3" id="text-2-2">


<p>
A <i>language</i> over an alphabet A is defined to be a set of strings over A.  For example, the finite set <code>{"ae", "eea", "i"}</code> is a finite language over the set of vowels, the infinite set <code>{"0", "1", "10", "11", "100", "101", "110", "111", ...}</code> is the infinite language of binary numerals for natural numbers over the alphabet of binary digits, and the infinite set <code>{"", "a", "aa", "aaa", "aaaa", ...}</code> is the infinite language of all strings over the alphabet <code>{a}</code>.
</p>
<p>
Since languages are sets, the usual set theoretic operations apply; they are: the binary operations of intersection, union, difference and symmetric difference, and a binary operation of complementation with respect to all strings over a given alphabet.  Only union will be important in what follows; in the literature it is often called <i>alternation</i>, written as an infix operator ='|'=, so <code>L | M</code> is the union or alternation of the two languages <code>L</code> and <code>M</code>.
</p>
<p>
Another important operation on languages arises not because languages are sets but because they are composed of strings, and strings can be concatenated.  If <code>S</code> and <code>T</code> are two strings, then their unit sets are the languages <code>{S}</code> and <code>{T}</code>, their concatenation is <code>S _ T</code>, and the unit set of their concatenation is <code>{S _ T}</code>, which we now also write as <code>{S}_{T}</code>, as the <i>concatenation</i> of two <i>languages</i>.  More generally, if <code>L</code> and <code>M</code> are two languages, then their concatenation <code>L _ M</code> is defined to be the language consisting of strings concatenated from two parts, the first from <code>L</code> and the second from <code>M</code>.  The unit language <code>{""}</code>, whose only element is the null string, is the left and right identity of concatenation of languages.  We shall write <code>0</code> for <code>{""}</code>, and it is important to distinguish it from the empty language, the null set <code>{}</code>, which is the left and right identity of alternation.
</p>
<p>
The n-fold concatenation of a language <code>L</code> with itself is its n-th <i>power</i>, written <code>L=^n , and note that the 1-st power, =L=^1 , is just =L</code>, and by definition the 0-th power of L, <code>L=^0 , is just 0, the language ={""}</code>.  The union of all powers, <code>L=^0 =|</code> <code>L=^1 =|</code> <code>L=^2 =|</code> <code>L=^3 =| ...</code>, The union of all positive powers, <code>L=^1 =|</code> <code>L=^2 =|</code> <code>L=^3 =| ...</code>, is written <code>L+</code> and called the positive closure of <code>L</code>.  The union of the first two powers, <code>L=^0 =|</code> <code>L=^1 , is written =L?</code>, and might be called the optional closure of <code>L</code> &mdash; it is just <code>L</code> with the null string added if it was not there already.
</p>
</div>

</div>
