text/09-regular-expressions.org
** Regular expressions and regular languages

Regular expressions are language denoting expressions built by means of the language theoretic binary operations of alternation (=union) and concatenation and the unary operation of Kleene closure from unit languages.  The following is an informal definition of the abstract syntax, it is not a definition of the concrete syntax since it says nothing about parenthesising larger expressions or about the relative precedence of the two binary operators.

#+begin_example
A regular expression over an alphabet A is either
  the expression 0,
    and it denotes the unit language whose only element is "", or
  the expression 'a' for some element a of A,
    and it denotes the unit language whose only element is "a", or
  the expression L | M,
      where L and M are regular expressions over A,
    and it denotes the alternation of
      the languages denoted by L and M, or
  the expression L _ M,
      where L and M are regular expressions over A,
    and it denotes the concatenation of
      the languages denoted by L and M, or
  the expression L*,
      where L is a regular expression over A,
    and it denotes the Kleene closure of the language denoted by L.
#+end_example

>From elementary mathematics you will recall the definition of rational numbers, those which "may be written in the form" m/n, where both m and n are integers.  It came as a great surprise to the Greek mathematicians that there are irrational numbers, such as the square root of 2, or the ratio of the circumference to the diameter of a circle.  Just as rational numbers are defined to be those denoted by fractions, so /regular language/s are defined to be those denoted by regular expressions.  It is not a great surprise to learn that there are languages that are not regular.  A very simple example is the language of well-formed strings of parentheses: ={"()", "()()", "(())", "(())()", ...}=.

Context free grammars, such as the (extended) /BNF/ notation we have been using, are a more powerful language description mechanism, adequate for the language of well-formed parentheses and many others.  We shall look at context free languages in Chapter 11.  But even these are not powerful enough for all languages, and other kinds of descriptions have been investigated, such as context sensitive grammars, attribute grammars, and van Wijngarden's two level grammars.  In all of these an attempt is made to describe infinite languages --- sets containing an infinite number of finitely long strings.  Although the languages are infinite, the descriptions are finitely long and certainly shorter than most of the strings in the language they describe.  It so turns out that there are languages for which there is no finite description mechanism at all; the most important of these is the language of arithmetic truths --- a result proved by G\"{o}del more than half a century ago.  You should consult a book on formal language theory for some details.

** Exercises and reading

*** /Formalisation/:
1) Give recursive definitions of all the operations on languages.
2) Attempt an axiomatisation of all the laws satisfied by the algebra of operations on languages.

*** /MU-expression/:
The expressive power of regular expressions can be increased dramatically by =MU=-expressions, which are a little similar to =LET=-expressions.  First, suppose we introduced =LETREC= as a recursive variant of =LET=, with the difference that in =LETREC i = e IN f= the identifier =i= is visible and usable inside =e=, and that inside =e= it means just what it has been defined to be.  To stop the recursion, some kind of choice is needed inside =e=.  Then define =MU i = e= to be short for =LETREC i = e IN i=.  The power of =LETREC= and =MU= depends very much on what kind of expression =e= can be.  If =e= is a regular expression, say =b | aic= then =MU i = b | aic= denotes the language ={"b", "abc", "aabcc", "aaabccc", ...}=.  (The name =MU= is in analogy with /lambda/, the function abstraction operator in functional languages such as the lambda-calculus.  One important difference is that a lambda abstraction needs actual parameters whereas =MU= does not; another difference is that lambda makes abstractions whereas =MU= does not.)  Include =MU=-expressions in your study of operations on languages.

*** /Binary relations/:
Study the calculus of binary relations.  Do you see any similarities with the calculus of languages?  Which binary relation corresponds to 0?  Which operation on binary relations corresponds to concatenation of languages?  Which operation on languages corresponds to the (unary) converse operation on binary relations?

*** /Reading/:
For regular expressions and regular languages in general, see the reading given in Chapter 11.

* A regular expression expander

In this section we shall write a program which reads regular expressions and expands them to strings which are in the language denoted by the expression.

