09-regular-expressions.html

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Regular expressions and regular languages</h3>
<div class="outline-text-3" id="text-2-3">


<p>
Regular expressions are language denoting expressions built by means of the language theoretic binary operations of alternation (=union) and concatenation and the unary operation of Kleene closure from unit languages.  The following is an informal definition of the abstract syntax, it is not a definition of the concrete syntax since it says nothing about parenthesising larger expressions or about the relative precedence of the two binary operators.
</p>



<pre class="example">A regular expression over an alphabet A is either
  the expression 0,
    and it denotes the unit language whose only element is "", or
  the expression 'a' for some element a of A,
    and it denotes the unit language whose only element is "a", or
  the expression L | M,
      where L and M are regular expressions over A,
    and it denotes the alternation of
      the languages denoted by L and M, or
  the expression L _ M,
      where L and M are regular expressions over A,
    and it denotes the concatenation of
      the languages denoted by L and M, or
  the expression L*,
      where L is a regular expression over A,
    and it denotes the Kleene closure of the language denoted by L.
</pre>


<p>
&gt;From elementary mathematics you will recall the definition of rational numbers, those which "may be written in the form" m/n, where both m and n are integers.  It came as a great surprise to the Greek mathematicians that there are irrational numbers, such as the square root of 2, or the ratio of the circumference to the diameter of a circle.  Just as rational numbers are defined to be those denoted by fractions, so /regular language/s are defined to be those denoted by regular expressions.  It is not a great surprise to learn that there are languages that are not regular.  A very simple example is the language of well-formed strings of parentheses: <code>{"()", "()()", "(())", "(())()", ...}</code>.
</p>
<p>
Context free grammars, such as the (extended) <i>BNF</i> notation we have been using, are a more powerful language description mechanism, adequate for the language of well-formed parentheses and many others.  We shall look at context free languages in Chapter 11.  But even these are not powerful enough for all languages, and other kinds of descriptions have been investigated, such as context sensitive grammars, attribute grammars, and van Wijngarden's two level grammars.  In all of these an attempt is made to describe infinite languages &mdash; sets containing an infinite number of finitely long strings.  Although the languages are infinite, the descriptions are finitely long and certainly shorter than most of the strings in the language they describe.  It so turns out that there are languages for which there is no finite description mechanism at all; the most important of these is the language of arithmetic truths &mdash; a result proved by G\"{o}del more than half a century ago.  You should consult a book on formal language theory for some details.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Exercises and reading</h3>
<div class="outline-text-3" id="text-2-4">



</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <i>Formalisation</i>:</h4>
<div class="outline-text-4" id="text-2-4-1">

<ol>
<li>Give recursive definitions of all the operations on languages.
</li>
<li>Attempt an axiomatisation of all the laws satisfied by the algebra of operations on languages.
</li>
</ol>


</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> <i>MU-expression</i>:</h4>
<div class="outline-text-4" id="text-2-4-2">

<p>The expressive power of regular expressions can be increased dramatically by <code>MU</code>-expressions, which are a little similar to <code>LET</code>-expressions.  First, suppose we introduced <code>LETREC</code> as a recursive variant of <code>LET</code>, with the difference that in <code>LETREC i = e IN f</code> the identifier <code>i</code> is visible and usable inside <code>e</code>, and that inside <code>e</code> it means just what it has been defined to be.  To stop the recursion, some kind of choice is needed inside <code>e</code>.  Then define <code>MU i = e</code> to be short for <code>LETREC i = e IN i</code>.  The power of <code>LETREC</code> and <code>MU</code> depends very much on what kind of expression <code>e</code> can be.  If <code>e</code> is a regular expression, say <code>b | aic</code> then <code>MU i = b | aic</code> denotes the language <code>{"b", "abc", "aabcc", "aaabccc", ...}</code>.  (The name <code>MU</code> is in analogy with <i>lambda</i>, the function abstraction operator in functional languages such as the lambda-calculus.  One important difference is that a lambda abstraction needs actual parameters whereas <code>MU</code> does not; another difference is that lambda makes abstractions whereas <code>MU</code> does not.)  Include <code>MU</code>-expressions in your study of operations on languages.
</p>
</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> <i>Binary relations</i>:</h4>
<div class="outline-text-4" id="text-2-4-3">

<p>Study the calculus of binary relations.  Do you see any similarities with the calculus of languages?  Which binary relation corresponds to 0?  Which operation on binary relations corresponds to concatenation of languages?  Which operation on languages corresponds to the (unary) converse operation on binary relations?
</p>
</div>

</div>

<div id="outline-container-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="section-number-4">2.4.4</span> <i>Reading</i>:</h4>
<div class="outline-text-4" id="text-2-4-4">

<p>For regular expressions and regular languages in general, see the reading given in Chapter 11.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A regular expression expander</h2>
<div class="outline-text-2" id="text-3">


<p>
In this section we shall write a program which reads regular expressions and expands them to strings which are in the language denoted by the expression.
</p>

</div>
