text/09-regular-expressions.org
** User manual

The program reads regular expressions over the alphabet of lower case letters, and then writes all the strings in the language denoted by the expression.  To avoid the program running forever on infinite languages, or to avoid the program running for too long on large languages, an upper limit can be set for the maximum length of the strings to be generated.

The program is intended for interactive use, and it provides a few prompts where appropriate.  The grammar for an interactive session is:

#+begin_example
session      ::=   ['H' | input [ number ]] '.'
#+end_example

The program repeatedly gives the top level prompt:

#+begin_example
input (for help type H) =
#+end_example

At this point the user may request help by responding with the character =H=.  The program then prints the following help message which is the BNF grammar for normal input:

#+begin_example
input        ::=   expression '.'
expression   ::=   term ['|' term]
term         ::=   factor [factor]
factor       ::=   (atom | '(' expression ')') ['*' | '+' | '?']
atom         ::=   'a' | 'b' | .. 'z' | '0' | '\' any character
#+end_example

The help message continues with a few examples.  If the user did not request the help message, the program expects an expression terminated by a period =.=..

An expression consists of one or more terms separated by =|=, and it denotes the union of the languages denoted by these terms.  A term consists of one or more factors, and it denotes the concatenation of the languages denoted by these factors.  Note that there is no explicit concatenation symbol.  A factor is either an atom or an expression enclosed in parentheses, and it may be followed by any number of postfix operators =*=, =+= or =?=.  An atom is either a lower case letter, denoting the language consisting of just that letter, or it is the digit =0=, denoting the language consisting of just the null string, or it is the escape character =\= followed by any character and it denotes the language consisting of just that character.  A factor which is just an atom or a parenthesised expression denotes the language denoted by the atom or the expression.  An operand followed by =*= denotes the Kleene closure of the language denoted by the operand.  An operand followed by =+= denotes the positive closure of the language denoted by the operand.  An operand followed by =?= denotes the union of the language containing just the null string with the language denoted by the operand.

If an illegal character, say =X= occurs, an error message is given which will be one of:

#+begin_example
Error: seen "X" when beginning of factor expected
Error: seen "X" when ")" expected
Error: seen "X" when "." expected
Error: seen "X" when regular expression too long
#+end_example

The last message will only be given for regular expressions containing more that 50 printing characters, not counting parentheses but counting implicit concatenations.  After an error has been given, the rest of the input line is discarded and the program returns to the top level prompt.

When an expression terminated by =.= has been read successfully, the program repeatedly prompts:

#+begin_example
current maximum [0..50] =
#+end_example

At this point the program expects the user to type an integer, and if the integer typed is greater than 50, it is taken to be 50.  If the integer is positive, the program will now expand the regular expression, and print on separate lines all strings over the alphabet ={a .. z}= which are in the language denoted by the regular expression and which do not exceed the given integer in length.  The null string does not print, but to avoid accidental infinite loops as may be caused by regular expressions containing =0*= explicitly or implicitly, the null string is taken to contribute to the length as much as any other atom.  When all strings have been printed, the program returns to the prompt for another integer.  If the integer is not positive, the program returns to the top level prompt.

The following is a brief interaction:

#+begin_example
$ RUN 23REGEXP.EXE
input (for help type H) =
a*  |  (bcd | efghij) + .
current maximum [0..50] =
10

a
aa
aaa
aaaa
aaaaa
aaaaaa
aaaaaaa
aaaaaaaa
aaaaaaaaa
bcd
efghij
bcdbcd
bcdefghij
bcdbcdbcd
efghijbcd
current maximum [0..50] =
0
input (for help type H) =
.
#+end_example

Note that the length was set to 10, but that no strings are longer than 9.  This because the null-string implicit in the Kleene star operation was taken to contribute 1 to the length, as explained earlier.

