text/09-regular-expressions.org
** Designing the implementation

The program has to read regular expressions, generate internal code and expand the internal code.  The structure of the main program and of the principal procedures follows the structure of the grammar given in the manual, and there should be no difficulties.  For the parser and translator to internal code we use the design steps of previous chapters.  The steps for satisfying visibility requirements and writing a recursive descent parser are routine by now.  But it is worth mentioning that there is no need to have a separate parsing procedure for the non-terminal atom; in the BNF grammar the notion of atoms was introduced because it makes the description simpler, whereas in the parser the atomic cases are just as readily handled by procedure factor.  For the internal code we take a tree representation similar to the one in Chapter 7 for the TYPROC language, and we use essentially the same method of generating code.  The single number which is the address of the principal node of the internal tree has to be passed as a parameter to the interpreter which expands the regular expression to a list of strings.  The remainder of this section deals with just this expansion process.

An ordinary recursive tree traversal will not do, since at best it would produce the regular expression in prefix or infix or postfix format.  A very different kind of traversal is needed.  The traversal to be described here will be useful in several later chapters which deal with AND=/=OR trees of various kinds.  For this reason the algorithm should be well understood.

Initially we concentrate on concatenation, alternation and atoms; the three closure operators are treated later.  As a starting point we take the associativity of concatenation and the (right) distributivity of concatenation over alternation, as expressed by the two laws:

#+begin_example
        (A B) C      ==    A (B C)
        (A | B) C    ==    A C | B C
#+end_example

The two laws can of course be used in either direction, but we shall use them left to right in the expansion process, as indicated by the following sketch of an algorithm.  Note that the first two clauses reduce the complexity of the left part of the expression, and that there is always a right part, =C=.  Eventually the left part will be an atom.

#+begin_example
To expand  (A B) C :
    expand  A (B C).
To expand  (A | B) C :
    expand  A C | B C.
To expand  'a' C :
    append 'a' to the output string;
    expand C.
#+end_example

Note the presence of =C= in all three clauses of the sketch; since a regular expression will not always be a concatenation, a dummy =C= will have to be added in the initial call, and recognised as a dummy by the expansion procedure.  In fact, when the dummy =C= has been reached, this will be a signal that an output string has been completed and is ready for printing.  Obviously expanding a concatenation =X Y= must mean expanding =X= and then expanding =Y=, and it is natural to take expanding an alternation =X | Y= to mean expanding =X= and then expanding =Y= --- although it could be done the other way around.  But the two occurrences of /and then/ in the previous sentence do not mean the same at all, the first means /followed by/, and the second means /and then do/ --- the sequencing of actions.  We may formalise this by giving expand two parameters, what to do first and what to do next.

#+begin_example
To expand (A B) and then C :
    expand A and then (B C).
To expand (A | B) and then C :
    expand A and then C;
    expand B and then C.
To expand an atom 'a' and then C :
    append 'a' to the output string;
    expand C and then nothing;
    [remove 'a' from the output string]
#+end_example

Using the technique of a continuation parameter introduced in Chapter 8, it is an easy matter to turn the above pseudo-code into a Pascal procedure.  It has two parameters, what to expand first and what to expand next.  The first parameter is given as a regular expression, or more precisely as an integer pointer to a tree representation of the regular expression.  The second parameter is given as a continuation procedure which, when called, expands whatever else has to be expanded.  The following is a high level description:

#+begin_example
PROCEDURE show;
BEGIN write the string that has been generated END;

PROCEDURE expand(t : tree; PROCEDURE cp);
    PROCEDURE expandright;
    BEGIN expand(right of t; cp) END;
BEGIN (* expand *)
CASE operator of t OF
    cat : expand(left of t; expandright);
    alt : expand(left of t, cp); expand(right of t, cp);
    atm : append the atom to the string;
          cp;
          delete the atom from the string
    END (* CASE *)
END; (* expand *)

BEGIN (* main *)
...
   read a regular expression t
   make the global string empty
   expand(t,show)
...
END. (* main *)
#+end_example

The description given should be adequate as a guide for writing the expanding procedure.  The three closure operators have to be implemented in a similar way.  If you are writing the implementation yourself, then the three lines that you need might well be the hardest you have ever written.  In addition you will also need one further local procedure to be used as a continuation in two of those lines.

To stop expansion beyond the current maximum length, two further additions are required: In the main body of the program the call to =expand= has to be wrapped inside a loop which writes a prompt for the maximum, reads the maximum, and only then calls =expand=.  In the body of =expand= the =CASE= statement has to be guarded by a test that the length of the string generated so far does already exceed the maximum.

For efficiency during the expansion process we can make one more modification.  Up to this point we have always considered straight-forward translation from the productions of the grammar to the parsing and translating procedures =expression=, =term= and =factor=.  The tree code generated this way is not the best, since it is left linear; it would be better if it were right linear.  To obtain right linear trees for both alternation and concatenation, it is best if the parsing and tree generating procedures for expressions and terms are based on the following productions:

#+begin_example
expression   ::=   term {'|' expression}
term         ::=   factor {term}
#+end_example

The language of regular expressions is not changed by substituting these two productions for their originals.

