text/09-regular-expressions.org
** The program

The following is the standard Pascal source program for the regular expression expander.

#+begin_src pascal
PROGRAM regexp(input,output);
(* REGular Expression eXPander *)

LABEL 1, 99;

CONST
    mcode = 50;
    maxstring = 50;
TYPE
    message = PACKED ARRAY [1..30] OF char;
    operator = (nul,sym,cat,alt,rep,pos,opt);
VAR
    ch : char;
    code : ARRAY [1..mcode] OF
                RECORD op : operator; left,right : integer END;
    cx,i : integer;
    finished : boolean;

    s : ARRAY [1..maxstring] OF char;
    p,m : integer;

(* - - - - -  R E A D E R - - - - - *)

PROCEDURE getch;
BEGIN
REPEAT
    IF eof THEN GOTO 99;
    read(ch)
    UNTIL ch > ' '
END  (* getch *);

PROCEDURE error(mes: message);
BEGIN
writeln;
writeln('Error : seen "',ch,'" when ',mes);
readln;
GOTO 1
END;

PROCEDURE gen(o : operator; l,r : integer);
BEGIN
cx := cx + 1;
IF cx > mcode THEN
    error('regular expression is too long');
WITH code[cx] DO
    BEGIN op := o; left := l; right := r END
END; (* gen *)

PROCEDURE expression;
VAR left : integer;

    PROCEDURE term;
    VAR left : integer;

        PROCEDURE factor;
        BEGIN (* factor *)
        CASE ch OF
            '0' :
                BEGIN
                gen(nul,0,0);
                getch
                END;
            'a','b','c','d','e','f','g','h','i',
            'j','k','l','m','n','o','p','q','r',
            's','t','u','v','w','x','y','z' :
                BEGIN
                gen(sym,ord(ch),0);
                getch;
                END;
            '\' :
                BEGIN
                gen(sym,ord(input^),0);
                read(ch); getch
                END;
            '(' :
                BEGIN
                getch;
                expression;
                IF ch = ')' THEN getch ELSE
                    error('")" expected                  ')
                END;
            END; (* CASE *)
        WHILE ch IN ['*','+','?'] DO
            BEGIN
            CASE ch OF
                '*' : gen(rep,0,cx);
                '+' : gen(pos,0,cx);
                '?' : gen(opt,0,cx)
                END;
            getch
            END (* WHILE *)
        END; (* factor *)

    BEGIN (* term *)
    factor;
    IF ch IN ['0','a'..'z','(','\' ] THEN
        BEGIN
        left := cx;
        term;
        gen(cat,left,cx)
        END
    END (* term *);

BEGIN (* expression *)
term;
IF ch = '|' THEN
    BEGIN
    getch;
    left := cx;
    expression;
    gen(alt,left,cx)
    END
END (* expression *);

(* - - - - -  E X P A N D E R  - - - - - *)

PROCEDURE show;
VAR i : integer;
BEGIN (* show *)
FOR i := 1 TO p DO write(s[i]);
writeln
END; (* show *)

PROCEDURE expand(t : integer; PROCEDURE cp);

    PROCEDURE putch(c : integer);
    BEGIN p := p+1; s[p] := chr(c); cp; p := p-1 END;

    PROCEDURE ditto;
    BEGIN expand(t,cp) END;

    PROCEDURE expand_right;
    BEGIN expand(code[t].right,cp) END;

BEGIN (* expand *)
IF p < m THEN
    WITH code[t] DO
        CASE op OF
            nul : putch(0);
            sym : putch(left);
            cat : expand(left,expand_right);
            alt : BEGIN expand(left,cp); expand(right,cp) END;
            rep : BEGIN putch(0); expand(right,ditto) END;
            pos : BEGIN expand(right,cp); expand(right,ditto) END;
            opt : BEGIN putch(0); expand(right,cp) END;
            END (* CASE *)
END; (* expand *)

(* - - - - -  M A I N  - - - - - *)

BEGIN (* main *)
finished := false;
1:
REPEAT
    writeln('input (for help type H) =  ');
    getch;
    IF ch = 'H' THEN
    BEGIN
        writeln;
        writeln('input        ::=   expression ''.''');
        writeln('expression   ::=   term [''|'' term]');
        writeln('term         ::=   factor [factor]');
        writeln('factor       ::=   ',
                '(atom | ''('' expression '')'') ',
                '[''*'' | ''+'' | ''?'']');
        writeln('atom         ::=   ',
                '''a'' | ''b'' | .. ''z'' | ''0'' | ',
                ' ''\'' any character');
        writeln;
        writeln('examples:');
        writeln('    a | bc | def .');
        writeln('    ( a* (bc)+  |  (defg)?  |  hh0hh )*  .');
        writeln;
        END
    ELSE IF ch &lt> '.' THEN
        BEGIN
        cx := 0;
        expression;
        IF ch &lt> '.' THEN
            error('"." expected                  ');
        REPEAT
            writeln('current maximum [0..',maxstring:0,'] = ');
            read(m);
            IF m > maxstring THEN m := maxstring;
            IF m > 0 THEN BEGIN p := 0; expand(cx,show) END
            UNTIL m < 1
        END
    ELSE finished := true
    UNTIL finished;
99:
END.
#+end_src

** Exercises and reading

** /Parser/:
The program as given is a regular expression generator.  Modify the program to turn it into a regular expression parser: the program should 1) read a regular expression, and 2) repeatedly read a string and determine whether the string is in the language defined by the expression.

** /Futility heuristic/:
As implemented, the program will often try to generate a string but then fail because the maximum length is exceeded.  It would be possible to avoid this by a different form of internal code, in which every node has an additional integer field which is the minimum length required to complete the string.  These fields can be computed at compile time in a simple manner.  At expansion time the field is examined to determine whether the string to be generated will not exceed the current maximum length.  The technique is equally applicable to generating as it is to parsing.  This is a heuristic used by the Snobol processor, see for example Griswold (1972, p 126).

** /Reading/:
For a quite different way of implementing regular expression parsing, see Kernighan and Plauger (1981, Ch. 5).  But note that their pattern matcher uses unanchored searches, and it does not have alternation at all.

** /Background reading/:
For a description of the technique of using continuations as parameters to implement backtracking, see Mellish and Hardy (1984, p 150).  Now that you know how procedures as parameters can be used for something useful such as backtracking, you might now wonder how procedures as parameters are implemented --- see MacLennan (1983, pp 247 -250).

** /MU-expression/:
Add the power of =MU=-expressions to the expanding program.  To make it easy for yourself, let =MU= always define single character symbols, say upper case letters.  There are two possibilities for calling a =MU=-defined symbol: Either they are simply used, but if they are to be taken literally then they are escaped with =\=.  Or they are escaped with, say, =$= for use, and left unescaped when they are to be taken literally.  You might want to review the macro expansion program in Chapter 4, both for a possible syntax and for the implementation.

