text/09-regular-expressions.org
** Addendum 2003

Pascal is one of only a few languages which allows local procedures to be passed as parameters in recursive calls.  It is of some interest to see whether there are other ways to achieve the same effect.  The next program below is again a Pascal program, but it uses an explicit stack of continuations instead of local procedures.

#+begin_src pascal
PROGRAM regexp_no_contin(input,output);
(* Using explicit links to implement continuation *)

LABEL 1, 99;

CONST
    mcode = 50;
    maxstring = 50;
TYPE
    message = PACKED ARRAY [1..30] OF char;
    operator = (nul,sym,cat,alt,rep,pos,opt);
VAR
    ch : char;
    code : ARRAY [1..mcode] OF
                RECORD op : operator; left,right : integer END;
    cx,i : integer;
    finished : boolean;

    s : ARRAY [1..maxstring] OF char;
    p,m : integer;

    links : ARRAY [1..maxstring] OF
		RECORD t, cp : integer END;
    lastlink : integer;

(* - - - - -  R E A D E R - - - - - *)

PROCEDURE getch;
BEGIN
REPEAT
    IF eof THEN GOTO 99;
    read(ch)
    UNTIL ch > ' '
END  (* getch *);

PROCEDURE error(mes: message);
BEGIN
writeln;
writeln('Error : seen "',ch,'" when ',mes);
readln;
GOTO 1
END;

PROCEDURE gen(o : operator; l,r : integer);
BEGIN
cx := cx + 1;
IF cx > mcode THEN
    error('regular expression is too long');
WITH code[cx] DO
    BEGIN op := o; left := l; right := r END
END; (* gen *)

PROCEDURE expression;
VAR left : integer;

    PROCEDURE term;
    VAR left : integer;

        PROCEDURE factor;
        BEGIN (* factor *)
        CASE ch OF
            '0' :
                BEGIN
                gen(nul,0,0);
                getch
                END;
            'a','b','c','d','e','f','g','h','i',
            'j','k','l','m','n','o','p','q','r',
            's','t','u','v','w','x','y','z' :
                BEGIN
                gen(sym,ord(ch),0);
                getch;
                END;
            '\' :
                BEGIN
                gen(sym,ord(input^),0);
                read(ch); getch
                END;
            '(' :
                BEGIN
                getch;
                expression;
                IF ch = ')' THEN getch ELSE
                    error('")" expected                  ')
                END;
            END; (* CASE *)
        WHILE ch IN ['*','+','?'] DO
            BEGIN
            CASE ch OF
                '*' : gen(rep,0,cx);
                '+' : gen(pos,0,cx);
                '?' : gen(opt,0,cx)
                END;
            getch
            END (* WHILE *)
        END; (* factor *)

    BEGIN (* term *)
    factor;
    IF ch IN ['0','a'..'z','(','\' ] THEN
        BEGIN
        left := cx;
        term;
        gen(cat,left,cx)
        END
    END (* term *);

BEGIN (* expression *)
term;
IF ch = '|' THEN
    BEGIN
    getch;
    left := cx;
    expression;
    gen(alt,left,cx)
    END
END (* expression *);

(* - - - - -  E X P A N D E R  - - - - - *)

PROCEDURE expand(t : integer; cp : integer);
VAR savelastlink : integer;

    PROCEDURE putch(c : integer);
    BEGIN
    p := p+1; s[p] := chr(c);
    IF cp > 0 THEN expand(links[cp].t, links[cp].cp) ELSE
	BEGIN (* show *)
	For i := 1 TO p DO write(s[i]);
	writeln
	END;
    p := p-1
    END;

    FUNCTION newcp(t : integer) : integer;
    BEGIN
    lastlink := lastlink + 1;
    links[lastlink].t := t;
    links[lastlink].cp := cp;
    newcp := lastlink
    END;

BEGIN (* expand *)
savelastlink := lastlink;
IF p < m THEN
    WITH code[t] DO
        CASE op OF
            nul : putch(0);
            sym : putch(left);
            cat : expand(left,newcp(right));
            alt : BEGIN expand(left,cp); expand(right,cp) END;
            rep : BEGIN putch(0); expand(right,newcp(t)) END;
            pos : BEGIN expand(right,cp); expand(right,newcp(t)) END;
            opt : BEGIN putch(0); expand(right,cp) END;
            END; (* CASE *)
lastlink := savelastlink
END; (* expand *)

(* - - - - -  M A I N  - - - - - *)

BEGIN (* main *)
finished := false;
1:
REPEAT
    writeln('input (for help type H) =  ');
    getch;
    IF ch = 'H' THEN
    BEGIN
        writeln;
        writeln('input        ::=   expression ''.''');
        writeln('expression   ::=   term [''|'' term]');
        writeln('term         ::=   factor [factor]');
        writeln('factor       ::=   ',
                '(atom | ''('' expression '')'') ',
                '[''*'' | ''+'' | ''?'']');
        writeln('atom         ::=   ',
                '''a'' | ''b'' | .. ''z'' | ''0'' | ',
                ' ''\'' any character');
        writeln;
        writeln('examples:');
        writeln('    a | bc | def .');
        writeln('    ( a* (bc)+  |  (defg)?  |  hh0hh )*  .');
        writeln;
        END
    ELSE IF ch <> '.' THEN
        BEGIN
        cx := 0;
        expression;
        IF ch <> '.' THEN
            error('"." expected                  ');
        REPEAT
            writeln('current maximum [0..',maxstring:0,'] = ');
            read(m);
            IF m > maxstring THEN m := maxstring;
            IF m > 0 THEN
		BEGIN lastlink := 0; p := 0; expand(cx,0) END
            UNTIL m < 1
        END
    ELSE finished := true
    UNTIL finished;
99:
END.
#+end_src

The next program is essentially a translation of the previous program into the C language (which officially does not allow local functions inside other functions).

#+begin_src c
/* regular expression expander */
/* Using explicit links to implement continuation */

#include <stdio.h>
#include <setjmp.h>
					/* Reading an expression : */
#define maxcode 200
jmp_buf begin;
int echo = 0;
char ch;
struct {char op; int left;} code[maxcode];
int cx;
void getch();
void error();
void generate(char c, int l);
void expression();
void term();
void factor();

void getch()
{
do { ch = getchar(); if (echo) putchar(ch); }
    while (ch <= ' ');
}
void error(char * mes)
{
    printf("error: seen '%c' when %s\n",ch,mes);
    do ch = getchar(); while (ch != '\n');
    longjmp(begin,0);
}
void generate(char c, int l)
{
    cx++;
    code[cx].op = c; code[cx].left = l;
}
void expression()
{
    int left;
    term();
    if (ch == '|')
      { left = cx; getch();
	expression();
	generate('|',left); }
}
void term()
{
    int left;
    factor();
    if (ch >= 'a' && ch <= 'z'  ||  ch == '0'  ||  ch == '(')
      { left = cx;
	term();
	generate('_',left); }
}
void factor()
{
    if (ch >= 'a' && ch <= 'z')
      { generate('a',ch); getch(); }
    else if (ch == '0')
      { generate('0',0); getch(); }
    else if (ch == '(')
      { getch(); expression();
	if (ch == ')') getch();
	    else error("')' expected"); }
    else error("'a'..'z','0' or '(' expected");
    while (ch == '*' || ch == '+' || ch == '?')
      { generate(ch,0); getch(); }
}
					/* Generating the strings */
#define maxstring 50
struct {int t; int cp;} links[maxcode];
int lastlink;
char s[maxstring];
int p,m;
int newcp(int t, int cp);
void putch(char c, int cp);
void expand(int t, int cp);

int newcp( int t, int cp)
{
    lastlink++;
    links[lastlink].t = t;
    links[lastlink].cp = cp;
    return lastlink;
}
void putch(char c, int cp)
{
    int i;
    s[++p] = c;
    if (cp >= 0) expand(links[cp].t, links[cp].cp);
    else
      { for (i = 0; i <= p; i++) printf("%c",s[i]);
	printf("\n"); }
    p--;
}
void expand(int t, int cp)
{
    if (p < m)
      { char op = code[t].op;
	int left = code[t].left;
	int right = t - 1;
	int savelastlink = lastlink;
	switch (op)
	  { case 'a' :
		putch(left,cp);
		break;
	    case '0' :
		putch(0,cp);
		break;
	    case '_' :
		expand(left,newcp(right,cp));
		break;
	    case '|' :
		expand(left,cp);
		expand(right,cp);
		break;
	    case '*' :
		putch(0,cp);
		expand(right,newcp(t,cp));
		break;
	    case '+' :
		expand(right,cp);
		expand(right,newcp(t,cp));
		break;
	    case '?' :
		putch(0,cp);
		expand(right,cp);
		break; }
	lastlink = savelastlink; }
}
void main()
{
    int finished = 0;
    setjmp(begin);
    do
      { printf("?- "); getch();
	if (ch == '!') { echo = 1; getch(); }
	if (ch != '.')
	  { cx = -1; expression();
	    if (ch != '.')  error("'.' expected");
	    do
	      { printf("current maximum [0..%d]\n",maxstring);
		scanf("%d",&m);
		if (m > maxstring) m = maxstring;
		if (m > 0)
		 { p = -1; lastlink = -1; expand(cx,-1); } }
	    while (m > 0); }
	else finished = 1; }
    while (!finished);
}
#+end_src

Another way of solving the problem is shown by the following version, also in the C language.

#+begin_src c
/* regular expression expander */
/* using stack addresses to implement continuation */

#include <stdio.h>
#include <setjmp.h>
					/* Reading an expression : */
#define maxcode 200
jmp_buf begin;
int echo = 0;
char ch;
struct {char op; int left;} code[maxcode];
int cx;
void getch();
void error();
void generate(char c, int l);
void expression();
void term();
void factor();

void getch()
{
do { ch = getchar(); if (echo) putchar(ch); }
    while (ch <= ' ');
}
void error(char * mes)
{
    printf("error: seen '%c' when %s\n",ch,mes);
    do ch = getchar(); while (ch != '\n');
    longjmp(begin,0);
}
void generate(char c, int l)
{
    cx++;
    code[cx].op = c; code[cx].left = l;
}
void expression()
{
    int left;
    term();
    if (ch == '|')
      { left = cx; getch();
	expression();
	generate('|',left); }
}
void term()
{
    int left;
    factor();
    if (ch >= 'a' && ch <= 'z'  ||  ch == '0'  ||  ch == '(')
      { left = cx;
	term();
	generate('_',left); }
}
void factor()
{
    if (ch >= 'a' && ch <= 'z')
      { generate(ch,0); getch(); }
    else if (ch == '0')
      { generate('0',0); getch(); }
    else if (ch == '(')
      { getch(); expression();
	if (ch == ')') getch();
	    else error("')' expected"); }
    else error("'a'..'z','0' or '(' expected");
    while (ch == '*' || ch == '+' || ch == '?')
      { generate(ch,0); getch(); }
}
					/* Generating the strings */
#define MAXSTRING 50
char s[MAXSTRING];
int p,m;
void putch(char c, int cp);
void expand(int t, int cp);

void putch(char c, int cp)
{
    int i;
    s[++p] = c;
    if (cp > 0) expand(*(int *)(cp + 8), *(int *)cp);
    else
      { for (i = 0; i <= p; i++) printf("%c",s[i]);
	printf("\n"); }
    p--;
}
int dummy;
void expand(int t, int cp)
{
    int newt,newcp;
    #define OP code[t].op
    #define LEFT code[t].left
    #define RIGHT (t-1)
    #define NEXT(T)  (newt = T, newcp = cp, (int)&newcp)
    dummy = (int)&newt - (int)&newcp; /* delete this at your peril ! */
    if (p < m)
	switch (OP)
	  { case '0' :
		putch(0,cp);
		break;
	    case '_' :
		expand(LEFT,NEXT(RIGHT));
		break;
	    case '|' :
		expand(LEFT,cp);
		expand(RIGHT,cp);
		break;
	    case '*' :
		putch(0,cp);
		expand(RIGHT,NEXT(t));
		break;
	    case '+' :
		expand(RIGHT,cp);
		expand(RIGHT,NEXT(t));
		break;
	    case '?' :
		putch(0,cp);
		expand(RIGHT,cp);
		break;
	    default :
		putch(OP,cp);
		break; }
}
void main()
{
    int finished = 0;
    setjmp(begin);
    do
      { printf("?- "); getch();
	if (ch == '!') { echo = 1; getch(); }
	if (ch != '.')
	  { cx = -1; expression();
	    if (ch != '.')  error("'.' expected");
	    do
	      { printf("current maximum [0..%d]\n",MAXSTRING);
		scanf("%d",&m);
		if (m > MAXSTRING) m = MAXSTRING;
		if (m > 0)
		 { p = -1; expand(cx,0); } }
	    while (m > 0); }
	else finished = 1; }
    while (!finished);
}
#+end_src

