09-regular-expressions.html

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Addendum 2003</h3>
<div class="outline-text-3" id="text-3-10">


<p>
Pascal is one of only a few languages which allows local procedures to be passed as parameters in recursive calls.  It is of some interest to see whether there are other ways to achieve the same effect.  The next program below is again a Pascal program, but it uses an explicit stack of continuations instead of local procedures.
</p>



<pre class="example">PROGRAM regexp_no_contin(input,output);
(* Using explicit links to implement continuation *)

LABEL 1, 99;

CONST
    mcode = 50;
    maxstring = 50;
TYPE
    message = PACKED ARRAY [1..30] OF char;
    operator = (nul,sym,cat,alt,rep,pos,opt);
VAR
    ch : char;
    code : ARRAY [1..mcode] OF
                RECORD op : operator; left,right : integer END;
    cx,i : integer;
    finished : boolean;

    s : ARRAY [1..maxstring] OF char;
    p,m : integer;

    links : ARRAY [1..maxstring] OF
                RECORD t, cp : integer END;
    lastlink : integer;

(* - - - - -  R E A D E R - - - - - *)

PROCEDURE getch;
BEGIN
REPEAT
    IF eof THEN GOTO 99;
    read(ch)
    UNTIL ch &gt; ' '
END  (* getch *);

PROCEDURE error(mes: message);
BEGIN
writeln;
writeln('Error : seen "',ch,'" when ',mes);
readln;
GOTO 1
END;

PROCEDURE gen(o : operator; l,r : integer);
BEGIN
cx := cx + 1;
IF cx &gt; mcode THEN
    error('regular expression is too long');
WITH code[cx] DO
    BEGIN op := o; left := l; right := r END
END; (* gen *)

PROCEDURE expression;
VAR left : integer;

    PROCEDURE term;
    VAR left : integer;

        PROCEDURE factor;
        BEGIN (* factor *)
        CASE ch OF
            '0' :
                BEGIN
                gen(nul,0,0);
                getch
                END;
            'a','b','c','d','e','f','g','h','i',
            'j','k','l','m','n','o','p','q','r',
            's','t','u','v','w','x','y','z' :
                BEGIN
                gen(sym,ord(ch),0);
                getch;
                END;
            '\' :
                BEGIN
                gen(sym,ord(input^),0);
                read(ch); getch
                END;
            '(' :
                BEGIN
                getch;
                expression;
                IF ch = ')' THEN getch ELSE
                    error('")" expected                  ')
                END;
            END; (* CASE *)
        WHILE ch IN ['*','+','?'] DO
            BEGIN
            CASE ch OF
                '*' : gen(rep,0,cx);
                '+' : gen(pos,0,cx);
                '?' : gen(opt,0,cx)
                END;
            getch
            END (* WHILE *)
        END; (* factor *)

    BEGIN (* term *)
    factor;
    IF ch IN ['0','a'..'z','(','\' ] THEN
        BEGIN
        left := cx;
        term;
        gen(cat,left,cx)
        END
    END (* term *);

BEGIN (* expression *)
term;
IF ch = '|' THEN
    BEGIN
    getch;
    left := cx;
    expression;
    gen(alt,left,cx)
    END
END (* expression *);

(* - - - - -  E X P A N D E R  - - - - - *)

PROCEDURE expand(t : integer; cp : integer);
VAR savelastlink : integer;

    PROCEDURE putch(c : integer);
    BEGIN
    p := p+1; s[p] := chr(c);
    IF cp &gt; 0 THEN expand(links[cp].t, links[cp].cp) ELSE
        BEGIN (* show *)
        For i := 1 TO p DO write(s[i]);
        writeln
        END;
    p := p-1
    END;

    FUNCTION newcp(t : integer) : integer;
    BEGIN
    lastlink := lastlink + 1;
    links[lastlink].t := t;
    links[lastlink].cp := cp;
    newcp := lastlink
    END;

BEGIN (* expand *)
savelastlink := lastlink;
IF p &lt; m THEN
    WITH code[t] DO
        CASE op OF
            nul : putch(0);
            sym : putch(left);
            cat : expand(left,newcp(right));
            alt : BEGIN expand(left,cp); expand(right,cp) END;
            rep : BEGIN putch(0); expand(right,newcp(t)) END;
            pos : BEGIN expand(right,cp); expand(right,newcp(t)) END;
            opt : BEGIN putch(0); expand(right,cp) END;
            END; (* CASE *)
lastlink := savelastlink
END; (* expand *)

(* - - - - -  M A I N  - - - - - *)

BEGIN (* main *)
finished := false;
1:
REPEAT
    writeln('input (for help type H) =  ');
    getch;
    IF ch = 'H' THEN
    BEGIN
        writeln;
        writeln('input        ::=   expression ''.''');
        writeln('expression   ::=   term [''|'' term]');
        writeln('term         ::=   factor [factor]');
        writeln('factor       ::=   ',
                '(atom | ''('' expression '')'') ',
                '[''*'' | ''+'' | ''?'']');
        writeln('atom         ::=   ',
                '''a'' | ''b'' | .. ''z'' | ''0'' | ',
                ' ''\'' any character');
        writeln;
        writeln('examples:');
        writeln('    a | bc | def .');
        writeln('    ( a* (bc)+  |  (defg)?  |  hh0hh )*  .');
        writeln;
        END
    ELSE IF ch &lt;&gt; '.' THEN
        BEGIN
        cx := 0;
        expression;
        IF ch &lt;&gt; '.' THEN
            error('"." expected                  ');
        REPEAT
            writeln('current maximum [0..',maxstring:0,'] = ');
            read(m);
            IF m &gt; maxstring THEN m := maxstring;
            IF m &gt; 0 THEN
                BEGIN lastlink := 0; p := 0; expand(cx,0) END
            UNTIL m &lt; 1
        END
    ELSE finished := true
    UNTIL finished;
99:
END.
</pre>


<p>
The next program is essentially a translation of the previous program into the C language (which officially does not allow local functions inside other functions).
</p>



<pre class="example">/* regular expression expander */
/* Using explicit links to implement continuation */

#include &lt;stdio.h&gt;
#include &lt;setjmp.h&gt;
                                        /* Reading an expression : */
#define maxcode 200
jmp_buf begin;
int echo = 0;
char ch;
struct {char op; int left;} code[maxcode];
int cx;
void getch();
void error();
void generate(char c, int l);
void expression();
void term();
void factor();

void getch()
{
do { ch = getchar(); if (echo) putchar(ch); }
    while (ch &lt;= ' ');
}
void error(char * mes)
{
    printf("error: seen '%c' when %s\n",ch,mes);
    do ch = getchar(); while (ch != '\n');
    longjmp(begin,0);
}
void generate(char c, int l)
{
    cx++;
    code[cx].op = c; code[cx].left = l;
}
void expression()
{
    int left;
    term();
    if (ch == '|')
      { left = cx; getch();
        expression();
        generate('|',left); }
}
void term()
{
    int left;
    factor();
    if (ch &gt;= 'a' &amp;&amp; ch &lt;= 'z'  ||  ch == '0'  ||  ch == '(')
      { left = cx;
        term();
        generate('_',left); }
}
void factor()
{
    if (ch &gt;= 'a' &amp;&amp; ch &lt;= 'z')
      { generate('a',ch); getch(); }
    else if (ch == '0')
      { generate('0',0); getch(); }
    else if (ch == '(')
      { getch(); expression();
        if (ch == ')') getch();
            else error("')' expected"); }
    else error("'a'..'z','0' or '(' expected");
    while (ch == '*' || ch == '+' || ch == '?')
      { generate(ch,0); getch(); }
}
                                        /* Generating the strings */
#define maxstring 50
struct {int t; int cp;} links[maxcode];
int lastlink;
char s[maxstring];
int p,m;
int newcp(int t, int cp);
void putch(char c, int cp);
void expand(int t, int cp);

int newcp( int t, int cp)
{
    lastlink++;
    links[lastlink].t = t;
    links[lastlink].cp = cp;
    return lastlink;
}
void putch(char c, int cp)
{
    int i;
    s[++p] = c;
    if (cp &gt;= 0) expand(links[cp].t, links[cp].cp);
    else
      { for (i = 0; i &lt;= p; i++) printf("%c",s[i]);
        printf("\n"); }
    p--;
}
void expand(int t, int cp)
{
    if (p &lt; m)
      { char op = code[t].op;
        int left = code[t].left;
        int right = t - 1;
        int savelastlink = lastlink;
        switch (op)
          { case 'a' :
                putch(left,cp);
                break;
            case '0' :
                putch(0,cp);
                break;
            case '_' :
                expand(left,newcp(right,cp));
                break;
            case '|' :
                expand(left,cp);
                expand(right,cp);
                break;
            case '*' :
                putch(0,cp);
                expand(right,newcp(t,cp));
                break;
            case '+' :
                expand(right,cp);
                expand(right,newcp(t,cp));
                break;
            case '?' :
                putch(0,cp);
                expand(right,cp);
                break; }
        lastlink = savelastlink; }
}
void main()
{
    int finished = 0;
    setjmp(begin);
    do
      { printf("?- "); getch();
        if (ch == '!') { echo = 1; getch(); }
        if (ch != '.')
          { cx = -1; expression();
            if (ch != '.')  error("'.' expected");
            do
              { printf("current maximum [0..%d]\n",maxstring);
                scanf("%d",&amp;m);
                if (m &gt; maxstring) m = maxstring;
                if (m &gt; 0)
                 { p = -1; lastlink = -1; expand(cx,-1); } }
            while (m &gt; 0); }
        else finished = 1; }
    while (!finished);
}
</pre>


<p>
Another way of solving the problem is shown by the following version, also in the C language.
</p>



<pre class="example">/* regular expression expander */
/* using stack addresses to implement continuation */

#include &lt;stdio.h&gt;
#include &lt;setjmp.h&gt;
                                        /* Reading an expression : */
#define maxcode 200
jmp_buf begin;
int echo = 0;
char ch;
struct {char op; int left;} code[maxcode];
int cx;
void getch();
void error();
void generate(char c, int l);
void expression();
void term();
void factor();

void getch()
{
do { ch = getchar(); if (echo) putchar(ch); }
    while (ch &lt;= ' ');
}
void error(char * mes)
{
    printf("error: seen '%c' when %s\n",ch,mes);
    do ch = getchar(); while (ch != '\n');
    longjmp(begin,0);
}
void generate(char c, int l)
{
    cx++;
    code[cx].op = c; code[cx].left = l;
}
void expression()
{
    int left;
    term();
    if (ch == '|')
      { left = cx; getch();
        expression();
        generate('|',left); }
}
void term()
{
    int left;
    factor();
    if (ch &gt;= 'a' &amp;&amp; ch &lt;= 'z'  ||  ch == '0'  ||  ch == '(')
      { left = cx;
        term();
        generate('_',left); }
}
void factor()
{
    if (ch &gt;= 'a' &amp;&amp; ch &lt;= 'z')
      { generate(ch,0); getch(); }
    else if (ch == '0')
      { generate('0',0); getch(); }
    else if (ch == '(')
      { getch(); expression();
        if (ch == ')') getch();
            else error("')' expected"); }
    else error("'a'..'z','0' or '(' expected");
    while (ch == '*' || ch == '+' || ch == '?')
      { generate(ch,0); getch(); }
}
                                        /* Generating the strings */
#define MAXSTRING 50
char s[MAXSTRING];
int p,m;
void putch(char c, int cp);
void expand(int t, int cp);

void putch(char c, int cp)
{
    int i;
    s[++p] = c;
    if (cp &gt; 0) expand(*(int *)(cp + 8), *(int *)cp);
    else
      { for (i = 0; i &lt;= p; i++) printf("%c",s[i]);
        printf("\n"); }
    p--;
}
int dummy;
void expand(int t, int cp)
{
    int newt,newcp;
    #define OP code[t].op
    #define LEFT code[t].left
    #define RIGHT (t-1)
    #define NEXT(T)  (newt = T, newcp = cp, (int)&amp;newcp)
    dummy = (int)&amp;newt - (int)&amp;newcp; /* delete this at your peril ! */
    if (p &lt; m)
        switch (OP)
          { case '0' :
                putch(0,cp);
                break;
            case '_' :
                expand(LEFT,NEXT(RIGHT));
                break;
            case '|' :
                expand(LEFT,cp);
                expand(RIGHT,cp);
                break;
            case '*' :
                putch(0,cp);
                expand(RIGHT,NEXT(t));
                break;
            case '+' :
                expand(RIGHT,cp);
                expand(RIGHT,NEXT(t));
                break;
            case '?' :
                putch(0,cp);
                expand(RIGHT,cp);
                break;
            default :
                putch(OP,cp);
                break; }
}
void main()
{
    int finished = 0;
    setjmp(begin);
    do
      { printf("?- "); getch();
        if (ch == '!') { echo = 1; getch(); }
        if (ch != '.')
          { cx = -1; expression();
            if (ch != '.')  error("'.' expected");
            do
              { printf("current maximum [0..%d]\n",MAXSTRING);
                scanf("%d",&amp;m);
                if (m &gt; MAXSTRING) m = MAXSTRING;
                if (m &gt; 0)
                 { p = -1; expand(cx,0); } }
            while (m &gt; 0); }
        else finished = 1; }
    while (!finished);
}
</pre>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> DEFINITION NOT FOUND: 2
</p>

</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:38:04 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
